In [71]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [56]:
df=pd.read_csv('train.csv',encoding='utf-8')

In [57]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [59]:
df.shape

(891, 12)

In [60]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [61]:
df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [63]:
df.median()

C:\Users\jeit\AppData\Local\Temp/ipykernel_16008/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Survived     0.0000
Pclass       3.0000
Age         28.0000
SibSp        0.0000
Parch        0.0000
Fare        14.4542
dtype: float64

In [68]:
df['Age'].fillna(df['Age'].mean(),axis=0,inplace=True)
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [81]:
df.Embarked.mode()

0    S
dtype: object

In [88]:
df['Embarked'].fillna('S',axis=0,inplace=True)

In [89]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [90]:
df.shape

(891, 8)

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

## LabelEncoding

In [93]:
from sklearn.preprocessing import LabelEncoder
from pandas.core.dtypes.common import is_numeric_dtype
le=LabelEncoder()

In [94]:
for col in df.columns:
    if is_numeric_dtype(df[col]):
        continue
    else:
        df[col]=le.fit_transform(df[col])
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [95]:
df.describe()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.647587,29.699118,0.523008,0.381594,32.204208,1.536476
std,0.486592,0.836071,0.477990,13.002015,1.102743,0.806057,49.693429,0.791503
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,22.000000,0.000000,0.000000,7.910400,1.000000
50%,0.000000,3.000000,1.000000,29.699118,0.000000,0.000000,14.454200,2.000000
75%,1.000000,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,2.000000

## Scaling

In [97]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler()

In [99]:
df['Fare']=scaler.fit_transform(df[['Fare']])
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         0       3    1  22.0      1      0  0.014151         2
1         1       1    0  38.0      1      0  0.139136         0
2         1       3    0  26.0      0      0  0.015469         2
3         1       1    0  35.0      1      0  0.103644         2
4         0       3    1  35.0      0      0  0.015713         2

In [100]:
df.corr()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
Survived,1.000000,-0.338481,-0.543351,-0.069809,-0.035322,0.081629,0.257307,-0.167675
Pclass,-0.338481,1.000000,0.131900,-0.331339,0.083081,0.018443,-0.549500,0.162098
Sex,-0.543351,0.131900,1.000000,0.084153,-0.114631,-0.245489,-0.182333,0.108262
Age,-0.069809,-0.331339,0.084153,1.000000,-0.232625,-0.179191,0.091566,-0.026749
SibSp,-0.035322,0.083081,-0.114631,-0.232625,1.000000,0.414838,0.159651,0.068230
Parch,0.081629,0.018443,-0.245489,-0.179191,0.414838,1.000000,0.216225,0.039798
Fare,0.257307,-0.549500,-0.182333,0.091566,0.159651,0.216225,1.000000,-0.224719
Embarked,-0.167675,0.162098,0.108262,-0.026749,0.068230,0.039798,-0.224719,1.000000

In [105]:
from sklearn.model_selection import train_test_split as tts

In [102]:
y=df['Survived']
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [104]:
x=df.drop('Survived',axis=1)
x.head()

   Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0       3    1  22.0      1      0  0.014151         2
1       1    0  38.0      1      0  0.139136         0
2       3    0  26.0      0      0  0.015469         2
3       1    0  35.0      1      0  0.103644         2
4       3    1  35.0      0      0  0.015713         2

In [172]:
x_train,x_test,y_train,y_test=tts(x,y,test_size=.30,random_state=47)

In [173]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()

In [174]:
model.fit(x_train,y_train)

LinearRegression()

In [175]:
pred=model.predict(x_test)
pred

array([ 3.81234532e-02,  1.31719289e-01,  2.06066404e-01,  3.24906019e-01,
        2.37316096e-01,  9.63854480e-01,  8.13800492e-01,  6.35874291e-01,
        7.14465766e-01,  2.30116498e-01,  3.83755218e-01,  1.39191477e-01,
        4.27515478e-01,  3.44013678e-01,  3.26367294e-01,  7.93857125e-01,
       -3.33514475e-02,  8.25190789e-01,  2.49024988e-01,  1.50245083e-01,
        7.26392898e-01,  1.83518193e-01,  1.64551642e-01,  1.20418270e-01,
        7.61806522e-02,  6.68475796e-01,  2.43546628e-01,  1.50696056e-01,
        6.97584257e-01,  9.44392993e-01,  2.67114061e-01,  1.04911421e+00,
        5.19639331e-01,  6.39276126e-01,  1.01529691e+00,  1.09709021e-01,
        5.78479608e-01,  5.35702818e-01,  4.95380775e-01,  8.61197691e-01,
        8.22105900e-01,  2.65958116e-01,  1.45629590e-01,  5.30543877e-01,
        1.68348850e-01,  1.10065146e-01,  9.20165446e-01,  2.97796638e-01,
        1.09780645e-01,  8.69516424e-01,  7.86867026e-01,  1.50649607e-01,
        1.50653462e-01,  1.09780645e-01,  3.41782174e-01,  7.30045594e-01,
        6.36054281e-01,  6.35520624e-01, -7.18361866e-02,  3.50196677e-01,
        1.10454156e-01,  1.06996430e-01,  1.08155125e-01,  5.03035859e-01,
        2.04483742e-01,  9.06725959e-01,  6.84978597e-01,  1.07812611e-01,
        1.50659269e-01,  4.23590536e-01,  1.50659269e-01,  1.09709021e-01,
        4.11258322e-01,  7.24881977e-02,  7.95884998e-02,  1.64551642e-01,
        1.09709021e-01,  3.08243189e-01,  2.84866606e-01,  5.20490079e-01,
        5.49640407e-01,  1.09652911e-01,  1.32967820e-01,  5.85420163e-01,
        1.78200454e-01,  1.89391370e-01,  1.39212588e-01,  4.51863575e-01,
        6.35874291e-01,  9.19417275e-01,  3.31308865e-01,  3.47287726e-02,
        5.91829620e-01,  1.18307061e+00,  7.61806522e-02,  3.45299330e-01,
        1.15123884e-01,  4.07464605e-01,  7.85823875e-01,  5.95154627e-01,
        2.28986881e-01,  2.12104776e-01,  7.38327806e-01,  8.25831448e-02,
        8.88203876e-01,  7.59055956e-02,  1.04661902e+00,  2.20003571e-01,
        4.29599447e-01,  4.68170236e-01,  1.72668170e-01,  9.03106894e-01,
        7.84241213e-01,  6.31287829e-01,  3.44157490e-02,  1.60808451e-01,
        3.47618998e-01,  4.71126736e-01,  1.09780645e-01,  6.53696693e-01,
        5.94995668e-01,  1.50988267e-01,  3.75639440e-01,  8.89041211e-02,
        4.50804393e-01,  3.19003680e-01,  9.52785753e-02,  1.28424603e-02,
        6.08775039e-01,  6.77093106e-01,  1.26293398e-01,  1.54525594e-01,
        1.70448043e-01,  6.00338907e-01,  6.47878524e-01,  8.81427784e-01,
        3.85820026e-01,  6.47270894e-02,  1.87157915e-01,  2.17089402e-01,
        4.98417463e-01,  1.70821586e-01,  1.09409053e-01,  7.63700858e-02,
        2.60176851e-01,  3.18746260e-01,  7.04361874e-01,  1.09780645e-01,
        5.56192687e-01,  8.81491651e-01,  6.26670467e-01,  5.59599631e-01,
        1.14105779e-01,  1.58276908e-01,  8.81487597e-01,  2.30507316e-01,
        3.28713975e-01,  1.58334402e-01,  5.66002454e-01,  1.41455444e-01,
        1.56572746e-01,  5.07552161e-01,  2.04619988e-02,  8.28782458e-01,
        5.52020408e-01,  8.48081092e-01,  1.00930573e+00, -3.69032391e-02,
        3.39534159e-01,  1.09709021e-01,  7.60449984e-01,  5.95084527e-01,
        3.37729096e-01,  1.64894204e-01,  2.23813668e-01,  7.90619358e-01,
        1.85575253e-01, -1.04326661e-02,  3.69034800e-01,  5.97664155e-02,
        1.26674651e-01,  7.20208668e-01,  1.90105523e-01,  2.02161292e-01,
        6.74906948e-01,  8.76987911e-01,  9.15846846e-01,  1.64609704e-01,
        3.30961776e-01,  5.91783164e-01,  7.22217499e-01,  2.55976043e-01,
        5.51096881e-02,  9.51745313e-03,  1.09780645e-01,  3.06911682e-01,
        1.50659269e-01,  2.17629497e-01,  8.24357760e-01,  2.74236307e-01,
        4.92959143e-01,  2.42847490e-01,  6.17147549e-01,  1.01539306e+00,
        3.20515713e-01,  1.27077225e-01,  6.18219630e-01,  6.24103729e-01,
        1.14852819e-01,  3.83801667e-01,  1.91435332e-01,  1.45443794e-01,
        9.52205141e-02,  1.73476217e-01, -8.83453789e-02,  3.90399839e-01,
        1.01453670e-01,  1.07884235e-01,  5.43625007e-01,  4.25425273e-01,
        2.87738735e-01,  9.11515134e-01,  6.16044816e-01,  5.69971060e-02,
        3.73896928e-01,  4.11258322e-01,  7.94469327e-01,  5.68241433e-01,
        7.60612555e-01,  2.81700362e-01,  6.10726061e-01,  2.70135133e-01,
        1.04732820e-01,  2.69348631e-01,  3.20180317e-02,  3.74451692e-01,
        4.47843121e-02,  1.43661099e-01,  1.63827463e-02,  6.44352173e-01,
        6.29181595e-01,  4.23300230e-01,  4.72218542e-01,  4.54029697e-02,
        5.94172242e-01,  1.95996118e-01,  7.59293189e-01,  3.25674014e-01,
        4.70186356e-01,  6.67503920e-01,  1.05305607e+00,  1.50659269e-01,
        6.05633293e-01,  9.38006767e-01,  1.10305177e-01,  2.76723086e-01,
        9.38694240e-02,  3.27151678e-01,  1.50223301e-01,  8.24681284e-01,
        1.91433382e-01,  1.70854472e-01,  2.42847490e-01,  2.07142441e-01,
        3.64535346e-04,  6.24485672e-01,  1.27213390e-01,  1.50659269e-01])

In [176]:
from sklearn.metrics import r2_score

In [177]:
r_score=r2_score(y_test,pred)
r_score

0.44321972305174173